## Plans :heavy_check_mark:

<details>
  <summary><h2>Terrateam Plan Output :heavy_check_mark:</h2></summary>

**Dir**: .
**Workspace**: default
**Success**: :heavy_check_mark:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.example_aws.module.batch.aws_batch_job_definition.this["example"] will be created
+   resource "aws_batch_job_definition" "this" {
+       arn                   = (known after apply)
+       container_properties  = (known after apply)
+       id                    = (known after apply)
+       name                  = "example-scheduled-jobs"
+       platform_capabilities = [
+           "FARGATE",
        ]
+       propagate_tags        = true
+       revision              = (known after apply)
+       tags                  = {
+           "job_definitions" = "example"
+           "module"          = "batch"
        }
+       tags_all              = {
+           "job_definitions" = "example"
+           "managed-by"      = "Terraform"
+           "module"          = "batch"
+           "workspace"       = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       type                  = "container"

+       timeout {
+           attempt_duration_seconds = 60
        }
    }

  # module.example_aws.module.eventbridge.aws_cloudwatch_event_rule.this["batch"] will be created
+   resource "aws_cloudwatch_event_rule" "this" {
+       arn                 = (known after apply)
+       description         = "Every 5 minutes"
+       event_bus_name      = "default"
+       id                  = (known after apply)
+       is_enabled          = true
+       name                = "batch-rule"
+       name_prefix         = (known after apply)
+       schedule_expression = "cron(0/5 * * * ? *)"
+       tags                = {
+           "Name"   = "batch-rule"
+           "module" = "eventbridge"
        }
+       tags_all            = {
+           "Name"       = "batch-rule"
+           "managed-by" = "Terraform"
+           "module"     = "eventbridge"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
    }

  # module.example_aws.module.eventbridge.aws_cloudwatch_event_target.this["fargate_spot"] will be created
+   resource "aws_cloudwatch_event_target" "this" {
+       arn            = "arn:aws:batch:us-east-1:376942697097:job-queue/fargate_spot"
+       event_bus_name = "default"
+       id             = (known after apply)
+       rule           = "batch-rule"
+       target_id      = (known after apply)

+       batch_target {
+           job_definition = (known after apply)
+           job_name       = "example-scheduled-jobs"
        }
    }

  # module.example_aws.module.execution_role.aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Condition = {
+                           Bool            = {
+                               "aws:MultiFactorAuthPresent" = "true"
                            }
+                           NumericLessThan = {
+                               "aws:MultiFactorAuthAge" = "86400"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS     = []
+                           Service = "ecs-tasks.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "example-scheduled-jobs-ecs-task-exec"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "module" = "execution_role"
        }
+       tags_all              = {
+           "managed-by" = "Terraform"
+           "module"     = "execution_role"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.example_aws.module.execution_role.aws_iam_role_policy_attachment.custom[0] will be created
+   resource "aws_iam_role_policy_attachment" "custom" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
+       role       = "example-scheduled-jobs-ecs-task-exec"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:. workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 76.65 | 76.65 | 0.00|
| | **Total** | **76.65** | **76.65** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>

